src/Performance-Test/physical-chemistry/temp-becnhmark.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ccnsb06-iiith.vlabs.ac.in (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        ccnsb06-iiith.vlabs.ac.in
Server Port:            80

Document Path:          /
Document Length:        9506 bytes

Concurrency Level:      190
Time taken for tests:   6.618 seconds
Complete requests:      1500
Failed requests:        0
Total transferred:      14606360 bytes
HTML transferred:       14259000 bytes
Requests per second:    226.66 [#/sec] (mean)
Time per request:       838.278 [ms] (mean)
Time per request:       4.412 [ms] (mean, across all concurrent requests)
Transfer rate:          2155.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   29 198.1      0    3010
Processing:    38  703 966.9    552    6614
Waiting:       33  700 966.9    549    6612
Total:         40  731 986.8    554    6615

Percentage of the requests served within a certain time (ms)
  50%    554
  66%    574
  75%    581
  80%    587
  90%    610
  95%   1553
  98%   6469
  99%   6578
 100%   6615 (longest request)